{"format": "graph-model", "generatedBy": "2.3.1", "convertedBy": "TensorFlow.js Converter v2.7.0", "userDefinedMetadata": {"signature": {"inputs": {"x:0": {"name": "x:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "10"}]}}}, "outputs": {"Identity_1:0": {"name": "Identity_1:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "64"}, {"size": "64"}, {"size": "3"}]}}, "Identity:0": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "64"}, {"size": "64"}, {"size": "3"}]}}}}}, "modelTopology": {"node": [{"name": "x", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "10"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/conv2d_transpose_6/strided_slice/stack", "op": "Const", "input": ["^x"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/conv2d_transpose_6/strided_slice/stack_1", "op": "Const", "input": ["^x"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/conv2d_transpose_6/strided_slice/stack_2", "op": "Const", "input": ["^x"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/conv2d_transpose_6/strided_slice_1/stack", "op": "Const", "input": ["^x"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/conv2d_transpose_6/strided_slice_1/stack_1", "op": "Const", "input": ["^x"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/conv2d_transpose_6/strided_slice_1/stack_2", "op": "Const", "input": ["^x"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/conv2d_transpose_6/add/y", "op": "Const", "input": ["^x"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/conv2d_transpose_6/strided_slice_2/stack", "op": "Const", "input": ["^x"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/conv2d_transpose_6/strided_slice_2/stack_1", "op": "Const", "input": ["^x"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/conv2d_transpose_6/strided_slice_2/stack_2", "op": "Const", "input": ["^x"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/conv2d_transpose_6/add_1/y", "op": "Const", "input": ["^x"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/conv2d_transpose_6/stack/3", "op": "Const", "input": ["^x"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "Func/StatefulPartitionedCall/StatefulPartitionedCall/input/_30", "op": "Const", "input": ["^x"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "3"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/StatefulPartitionedCall/input/_31", "op": "Const", "input": ["^x"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/ReshapeOutput/strided_slice/stack", "op": "Const", "input": ["^x"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/ReshapeOutput/strided_slice/stack_1", "op": "Const", "input": ["^x"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/ReshapeOutput/strided_slice/stack_2", "op": "Const", "input": ["^x"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/ReshapeOutput/Reshape/shape/1", "op": "Const", "input": ["^x"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/ReshapeOutput/Reshape/shape/2", "op": "Const", "input": ["^x"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/ReshapeOutput/Reshape/shape/3", "op": "Const", "input": ["^x"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/conv2d_transpose_7/strided_slice/stack", "op": "Const", "input": ["^x"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/conv2d_transpose_7/strided_slice/stack_1", "op": "Const", "input": ["^x"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/conv2d_transpose_7/strided_slice/stack_2", "op": "Const", "input": ["^x"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/conv2d_transpose_7/strided_slice_1/stack", "op": "Const", "input": ["^x"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/conv2d_transpose_7/strided_slice_1/stack_1", "op": "Const", "input": ["^x"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/conv2d_transpose_7/strided_slice_1/stack_2", "op": "Const", "input": ["^x"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/conv2d_transpose_7/add/y", "op": "Const", "input": ["^x"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/conv2d_transpose_7/strided_slice_2/stack", "op": "Const", "input": ["^x"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/conv2d_transpose_7/strided_slice_2/stack_1", "op": "Const", "input": ["^x"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/conv2d_transpose_7/strided_slice_2/stack_2", "op": "Const", "input": ["^x"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/conv2d_transpose_7/add_1/y", "op": "Const", "input": ["^x"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/conv2d_transpose_7/stack/3", "op": "Const", "input": ["^x"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "Func/StatefulPartitionedCall/StatefulPartitionedCall/input/_32", "op": "Const", "input": ["^x"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "3"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/sequential_1/conv2d_transpose_3/strided_slice/stack", "op": "Const", "input": ["^x"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/sequential_1/conv2d_transpose_3/strided_slice/stack_1", "op": "Const", "input": ["^x"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/sequential_1/conv2d_transpose_3/strided_slice/stack_2", "op": "Const", "input": ["^x"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/sequential_1/conv2d_transpose_3/strided_slice_1/stack", "op": "Const", "input": ["^x"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/sequential_1/conv2d_transpose_3/strided_slice_1/stack_1", "op": "Const", "input": ["^x"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/sequential_1/conv2d_transpose_3/strided_slice_1/stack_2", "op": "Const", "input": ["^x"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/sequential_1/conv2d_transpose_3/mul/y", "op": "Const", "input": ["^x"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/sequential_1/conv2d_transpose_3/add/y", "op": "Const", "input": ["^x"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/sequential_1/conv2d_transpose_3/strided_slice_2/stack", "op": "Const", "input": ["^x"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/sequential_1/conv2d_transpose_3/strided_slice_2/stack_1", "op": "Const", "input": ["^x"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/sequential_1/conv2d_transpose_3/strided_slice_2/stack_2", "op": "Const", "input": ["^x"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/sequential_1/conv2d_transpose_3/mul_1/y", "op": "Const", "input": ["^x"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/sequential_1/conv2d_transpose_3/add_1/y", "op": "Const", "input": ["^x"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/sequential_1/conv2d_transpose_3/stack/3", "op": "Const", "input": ["^x"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "Func/StatefulPartitionedCall/StatefulPartitionedCall/input/_28", "op": "Const", "input": ["^x"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}, {"size": "4"}, {"size": "32"}, {"size": "32"}]}}}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/sequential_1/conv2d_transpose_2/strided_slice/stack", "op": "Const", "input": ["^x"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/sequential_1/conv2d_transpose_2/strided_slice/stack_1", "op": "Const", "input": ["^x"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/sequential_1/conv2d_transpose_2/strided_slice/stack_2", "op": "Const", "input": ["^x"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/sequential_1/conv2d_transpose_2/strided_slice_1/stack", "op": "Const", "input": ["^x"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/sequential_1/conv2d_transpose_2/strided_slice_1/stack_1", "op": "Const", "input": ["^x"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/sequential_1/conv2d_transpose_2/strided_slice_1/stack_2", "op": "Const", "input": ["^x"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/sequential_1/conv2d_transpose_2/mul/y", "op": "Const", "input": ["^x"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/sequential_1/conv2d_transpose_2/add/y", "op": "Const", "input": ["^x"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/sequential_1/conv2d_transpose_2/strided_slice_2/stack", "op": "Const", "input": ["^x"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/sequential_1/conv2d_transpose_2/strided_slice_2/stack_1", "op": "Const", "input": ["^x"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/sequential_1/conv2d_transpose_2/strided_slice_2/stack_2", "op": "Const", "input": ["^x"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/sequential_1/conv2d_transpose_2/mul_1/y", "op": "Const", "input": ["^x"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/sequential_1/conv2d_transpose_2/add_1/y", "op": "Const", "input": ["^x"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/sequential_1/conv2d_transpose_2/stack/3", "op": "Const", "input": ["^x"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "Func/StatefulPartitionedCall/StatefulPartitionedCall/input/_26", "op": "Const", "input": ["^x"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}, {"size": "4"}, {"size": "32"}, {"size": "64"}]}}}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/sequential_1/conv2d_transpose_1/strided_slice/stack", "op": "Const", "input": ["^x"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/sequential_1/conv2d_transpose_1/strided_slice/stack_1", "op": "Const", "input": ["^x"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/sequential_1/conv2d_transpose_1/strided_slice/stack_2", "op": "Const", "input": ["^x"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/sequential_1/conv2d_transpose_1/strided_slice_1/stack", "op": "Const", "input": ["^x"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/sequential_1/conv2d_transpose_1/strided_slice_1/stack_1", "op": "Const", "input": ["^x"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/sequential_1/conv2d_transpose_1/strided_slice_1/stack_2", "op": "Const", "input": ["^x"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/sequential_1/conv2d_transpose_1/mul/y", "op": "Const", "input": ["^x"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/sequential_1/conv2d_transpose_1/add/y", "op": "Const", "input": ["^x"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/sequential_1/conv2d_transpose_1/strided_slice_2/stack", "op": "Const", "input": ["^x"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/sequential_1/conv2d_transpose_1/strided_slice_2/stack_1", "op": "Const", "input": ["^x"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/sequential_1/conv2d_transpose_1/strided_slice_2/stack_2", "op": "Const", "input": ["^x"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/sequential_1/conv2d_transpose_1/mul_1/y", "op": "Const", "input": ["^x"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/sequential_1/conv2d_transpose_1/add_1/y", "op": "Const", "input": ["^x"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/sequential_1/conv2d_transpose_1/stack/3", "op": "Const", "input": ["^x"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "Func/StatefulPartitionedCall/StatefulPartitionedCall/input/_24", "op": "Const", "input": ["^x"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}, {"size": "4"}, {"size": "64"}, {"size": "64"}]}}}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/sequential_1/conv2d_transpose/strided_slice/stack", "op": "Const", "input": ["^x"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/sequential_1/conv2d_transpose/strided_slice/stack_1", "op": "Const", "input": ["^x"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/sequential_1/conv2d_transpose/strided_slice/stack_2", "op": "Const", "input": ["^x"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/sequential_1/conv2d_transpose/strided_slice_1/stack", "op": "Const", "input": ["^x"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/sequential_1/conv2d_transpose/strided_slice_1/stack_1", "op": "Const", "input": ["^x"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/sequential_1/conv2d_transpose/strided_slice_1/stack_2", "op": "Const", "input": ["^x"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/sequential_1/conv2d_transpose/mul/y", "op": "Const", "input": ["^x"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/sequential_1/conv2d_transpose/add/y", "op": "Const", "input": ["^x"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/sequential_1/conv2d_transpose/strided_slice_2/stack", "op": "Const", "input": ["^x"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/sequential_1/conv2d_transpose/strided_slice_2/stack_1", "op": "Const", "input": ["^x"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/sequential_1/conv2d_transpose/strided_slice_2/stack_2", "op": "Const", "input": ["^x"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/sequential_1/conv2d_transpose/mul_1/y", "op": "Const", "input": ["^x"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/sequential_1/conv2d_transpose/add_1/y", "op": "Const", "input": ["^x"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/sequential_1/conv2d_transpose/stack/3", "op": "Const", "input": ["^x"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "Func/StatefulPartitionedCall/StatefulPartitionedCall/input/_22", "op": "Const", "input": ["^x"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}, {"size": "4"}, {"size": "64"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/StatefulPartitionedCall/input/_20", "op": "Const", "input": ["^x"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "10"}, {"size": "256"}]}}}}}, {"name": "Func/StatefulPartitionedCall/StatefulPartitionedCall/input/_21", "op": "Const", "input": ["^x"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/ReshapeTheta/strided_slice/stack", "op": "Const", "input": ["^x"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/ReshapeTheta/strided_slice/stack_1", "op": "Const", "input": ["^x"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/ReshapeTheta/strided_slice/stack_2", "op": "Const", "input": ["^x"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/ReshapeTheta/Reshape/shape/1", "op": "Const", "input": ["^x"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/ReshapeTheta/Reshape/shape/2", "op": "Const", "input": ["^x"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/ReshapeTheta/Reshape/shape/3", "op": "Const", "input": ["^x"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "Func/StatefulPartitionedCall/StatefulPartitionedCall/input/_23", "op": "Const", "input": ["^x"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}}}, {"name": "Func/StatefulPartitionedCall/StatefulPartitionedCall/input/_25", "op": "Const", "input": ["^x"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/StatefulPartitionedCall/input/_27", "op": "Const", "input": ["^x"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}}}, {"name": "Func/StatefulPartitionedCall/StatefulPartitionedCall/input/_29", "op": "Const", "input": ["^x"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/dense/Relu", "op": "_FusedMatMul", "input": ["x", "Func/StatefulPartitionedCall/StatefulPartitionedCall/input/_20", "Func/StatefulPartitionedCall/StatefulPartitionedCall/input/_21"], "device": "/device:CPU:0", "attr": {"epsilon": {"f": 0.0}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "transpose_b": {"b": false}, "transpose_a": {"b": false}, "num_args": {"i": "1"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/ReshapeTheta/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/StatefulPartitionedCall/dense/Relu"], "attr": {"out_type": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/ReshapeTheta/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/StatefulPartitionedCall/ReshapeTheta/Shape", "StatefulPartitionedCall/StatefulPartitionedCall/ReshapeTheta/strided_slice/stack", "StatefulPartitionedCall/StatefulPartitionedCall/ReshapeTheta/strided_slice/stack_1", "StatefulPartitionedCall/StatefulPartitionedCall/ReshapeTheta/strided_slice/stack_2"], "attr": {"begin_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "1"}, "end_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "new_axis_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/ReshapeTheta/Reshape/shape", "op": "Pack", "input": ["StatefulPartitionedCall/StatefulPartitionedCall/ReshapeTheta/strided_slice", "StatefulPartitionedCall/StatefulPartitionedCall/ReshapeTheta/Reshape/shape/1", "StatefulPartitionedCall/StatefulPartitionedCall/ReshapeTheta/Reshape/shape/2", "StatefulPartitionedCall/StatefulPartitionedCall/ReshapeTheta/Reshape/shape/3"], "attr": {"N": {"i": "4"}, "axis": {"i": "0"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/ReshapeTheta/Reshape", "op": "Reshape", "input": ["StatefulPartitionedCall/StatefulPartitionedCall/dense/Relu", "StatefulPartitionedCall/StatefulPartitionedCall/ReshapeTheta/Reshape/shape"], "attr": {"Tshape": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/sequential_1/conv2d_transpose/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/StatefulPartitionedCall/ReshapeTheta/Reshape"], "attr": {"out_type": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/sequential_1/conv2d_transpose/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/StatefulPartitionedCall/sequential_1/conv2d_transpose/Shape", "StatefulPartitionedCall/StatefulPartitionedCall/sequential_1/conv2d_transpose/strided_slice/stack", "StatefulPartitionedCall/StatefulPartitionedCall/sequential_1/conv2d_transpose/strided_slice/stack_1", "StatefulPartitionedCall/StatefulPartitionedCall/sequential_1/conv2d_transpose/strided_slice/stack_2"], "attr": {"begin_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "ellipsis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "shrink_axis_mask": {"i": "1"}, "end_mask": {"i": "0"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/sequential_1/conv2d_transpose/strided_slice_1", "op": "StridedSlice", "input": ["StatefulPartitionedCall/StatefulPartitionedCall/sequential_1/conv2d_transpose/Shape", "StatefulPartitionedCall/StatefulPartitionedCall/sequential_1/conv2d_transpose/strided_slice_1/stack", "StatefulPartitionedCall/StatefulPartitionedCall/sequential_1/conv2d_transpose/strided_slice_1/stack_1", "StatefulPartitionedCall/StatefulPartitionedCall/sequential_1/conv2d_transpose/strided_slice_1/stack_2"], "attr": {"T": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "1"}, "end_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "new_axis_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/sequential_1/conv2d_transpose/strided_slice_2", "op": "StridedSlice", "input": ["StatefulPartitionedCall/StatefulPartitionedCall/sequential_1/conv2d_transpose/Shape", "StatefulPartitionedCall/StatefulPartitionedCall/sequential_1/conv2d_transpose/strided_slice_2/stack", "StatefulPartitionedCall/StatefulPartitionedCall/sequential_1/conv2d_transpose/strided_slice_2/stack_1", "StatefulPartitionedCall/StatefulPartitionedCall/sequential_1/conv2d_transpose/strided_slice_2/stack_2"], "attr": {"Index": {"type": "DT_INT32"}, "begin_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "shrink_axis_mask": {"i": "1"}, "end_mask": {"i": "0"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/sequential_1/conv2d_transpose/mul", "op": "Mul", "input": ["StatefulPartitionedCall/StatefulPartitionedCall/sequential_1/conv2d_transpose/strided_slice_1", "StatefulPartitionedCall/StatefulPartitionedCall/sequential_1/conv2d_transpose/mul/y"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/sequential_1/conv2d_transpose/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/StatefulPartitionedCall/sequential_1/conv2d_transpose/strided_slice_2", "StatefulPartitionedCall/StatefulPartitionedCall/sequential_1/conv2d_transpose/mul_1/y"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/sequential_1/conv2d_transpose/add", "op": "AddV2", "input": ["StatefulPartitionedCall/StatefulPartitionedCall/sequential_1/conv2d_transpose/mul", "StatefulPartitionedCall/StatefulPartitionedCall/sequential_1/conv2d_transpose/add/y"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/sequential_1/conv2d_transpose/add_1", "op": "AddV2", "input": ["StatefulPartitionedCall/StatefulPartitionedCall/sequential_1/conv2d_transpose/mul_1", "StatefulPartitionedCall/StatefulPartitionedCall/sequential_1/conv2d_transpose/add_1/y"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/sequential_1/conv2d_transpose/stack", "op": "Pack", "input": ["StatefulPartitionedCall/StatefulPartitionedCall/sequential_1/conv2d_transpose/strided_slice", "StatefulPartitionedCall/StatefulPartitionedCall/sequential_1/conv2d_transpose/add", "StatefulPartitionedCall/StatefulPartitionedCall/sequential_1/conv2d_transpose/add_1", "StatefulPartitionedCall/StatefulPartitionedCall/sequential_1/conv2d_transpose/stack/3"], "attr": {"axis": {"i": "0"}, "T": {"type": "DT_INT32"}, "N": {"i": "4"}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/sequential_1/conv2d_transpose/conv2d_transpose", "op": "Conv2DBackpropInput", "input": ["StatefulPartitionedCall/StatefulPartitionedCall/sequential_1/conv2d_transpose/stack", "Func/StatefulPartitionedCall/StatefulPartitionedCall/input/_22", "StatefulPartitionedCall/StatefulPartitionedCall/ReshapeTheta/Reshape"], "attr": {"use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "padding": {"s": "VkFMSUQ="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/sequential_1/conv2d_transpose/BiasAdd", "op": "BiasAdd", "input": ["StatefulPartitionedCall/StatefulPartitionedCall/sequential_1/conv2d_transpose/conv2d_transpose", "Func/StatefulPartitionedCall/StatefulPartitionedCall/input/_23"], "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/sequential_1/conv2d_transpose/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/StatefulPartitionedCall/sequential_1/conv2d_transpose/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/sequential_1/conv2d_transpose_1/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/StatefulPartitionedCall/sequential_1/conv2d_transpose/Relu"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/sequential_1/conv2d_transpose_1/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/StatefulPartitionedCall/sequential_1/conv2d_transpose_1/Shape", "StatefulPartitionedCall/StatefulPartitionedCall/sequential_1/conv2d_transpose_1/strided_slice/stack", "StatefulPartitionedCall/StatefulPartitionedCall/sequential_1/conv2d_transpose_1/strided_slice/stack_1", "StatefulPartitionedCall/StatefulPartitionedCall/sequential_1/conv2d_transpose_1/strided_slice/stack_2"], "attr": {"begin_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "1"}, "T": {"type": "DT_INT32"}, "ellipsis_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/sequential_1/conv2d_transpose_1/strided_slice_1", "op": "StridedSlice", "input": ["StatefulPartitionedCall/StatefulPartitionedCall/sequential_1/conv2d_transpose_1/Shape", "StatefulPartitionedCall/StatefulPartitionedCall/sequential_1/conv2d_transpose_1/strided_slice_1/stack", "StatefulPartitionedCall/StatefulPartitionedCall/sequential_1/conv2d_transpose_1/strided_slice_1/stack_1", "StatefulPartitionedCall/StatefulPartitionedCall/sequential_1/conv2d_transpose_1/strided_slice_1/stack_2"], "attr": {"end_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}, "begin_mask": {"i": "0"}, "shrink_axis_mask": {"i": "1"}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/sequential_1/conv2d_transpose_1/strided_slice_2", "op": "StridedSlice", "input": ["StatefulPartitionedCall/StatefulPartitionedCall/sequential_1/conv2d_transpose_1/Shape", "StatefulPartitionedCall/StatefulPartitionedCall/sequential_1/conv2d_transpose_1/strided_slice_2/stack", "StatefulPartitionedCall/StatefulPartitionedCall/sequential_1/conv2d_transpose_1/strided_slice_2/stack_1", "StatefulPartitionedCall/StatefulPartitionedCall/sequential_1/conv2d_transpose_1/strided_slice_2/stack_2"], "attr": {"end_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "shrink_axis_mask": {"i": "1"}, "T": {"type": "DT_INT32"}, "Index": {"type": "DT_INT32"}, "begin_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/sequential_1/conv2d_transpose_1/mul", "op": "Mul", "input": ["StatefulPartitionedCall/StatefulPartitionedCall/sequential_1/conv2d_transpose_1/strided_slice_1", "StatefulPartitionedCall/StatefulPartitionedCall/sequential_1/conv2d_transpose_1/mul/y"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/sequential_1/conv2d_transpose_1/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/StatefulPartitionedCall/sequential_1/conv2d_transpose_1/strided_slice_2", "StatefulPartitionedCall/StatefulPartitionedCall/sequential_1/conv2d_transpose_1/mul_1/y"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/sequential_1/conv2d_transpose_1/add", "op": "AddV2", "input": ["StatefulPartitionedCall/StatefulPartitionedCall/sequential_1/conv2d_transpose_1/mul", "StatefulPartitionedCall/StatefulPartitionedCall/sequential_1/conv2d_transpose_1/add/y"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/sequential_1/conv2d_transpose_1/add_1", "op": "AddV2", "input": ["StatefulPartitionedCall/StatefulPartitionedCall/sequential_1/conv2d_transpose_1/mul_1", "StatefulPartitionedCall/StatefulPartitionedCall/sequential_1/conv2d_transpose_1/add_1/y"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/sequential_1/conv2d_transpose_1/stack", "op": "Pack", "input": ["StatefulPartitionedCall/StatefulPartitionedCall/sequential_1/conv2d_transpose_1/strided_slice", "StatefulPartitionedCall/StatefulPartitionedCall/sequential_1/conv2d_transpose_1/add", "StatefulPartitionedCall/StatefulPartitionedCall/sequential_1/conv2d_transpose_1/add_1", "StatefulPartitionedCall/StatefulPartitionedCall/sequential_1/conv2d_transpose_1/stack/3"], "attr": {"axis": {"i": "0"}, "N": {"i": "4"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/sequential_1/conv2d_transpose_1/conv2d_transpose", "op": "Conv2DBackpropInput", "input": ["StatefulPartitionedCall/StatefulPartitionedCall/sequential_1/conv2d_transpose_1/stack", "Func/StatefulPartitionedCall/StatefulPartitionedCall/input/_24", "StatefulPartitionedCall/StatefulPartitionedCall/sequential_1/conv2d_transpose/Relu"], "attr": {"padding": {"s": "VkFMSUQ="}, "use_cudnn_on_gpu": {"b": true}, "data_format": {"s": "TkhXQw=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/sequential_1/conv2d_transpose_1/BiasAdd", "op": "BiasAdd", "input": ["StatefulPartitionedCall/StatefulPartitionedCall/sequential_1/conv2d_transpose_1/conv2d_transpose", "Func/StatefulPartitionedCall/StatefulPartitionedCall/input/_25"], "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/sequential_1/conv2d_transpose_1/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/StatefulPartitionedCall/sequential_1/conv2d_transpose_1/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/sequential_1/conv2d_transpose_2/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/StatefulPartitionedCall/sequential_1/conv2d_transpose_1/Relu"], "attr": {"out_type": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/sequential_1/conv2d_transpose_2/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/StatefulPartitionedCall/sequential_1/conv2d_transpose_2/Shape", "StatefulPartitionedCall/StatefulPartitionedCall/sequential_1/conv2d_transpose_2/strided_slice/stack", "StatefulPartitionedCall/StatefulPartitionedCall/sequential_1/conv2d_transpose_2/strided_slice/stack_1", "StatefulPartitionedCall/StatefulPartitionedCall/sequential_1/conv2d_transpose_2/strided_slice/stack_2"], "attr": {"shrink_axis_mask": {"i": "1"}, "new_axis_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "end_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "ellipsis_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/sequential_1/conv2d_transpose_2/strided_slice_1", "op": "StridedSlice", "input": ["StatefulPartitionedCall/StatefulPartitionedCall/sequential_1/conv2d_transpose_2/Shape", "StatefulPartitionedCall/StatefulPartitionedCall/sequential_1/conv2d_transpose_2/strided_slice_1/stack", "StatefulPartitionedCall/StatefulPartitionedCall/sequential_1/conv2d_transpose_2/strided_slice_1/stack_1", "StatefulPartitionedCall/StatefulPartitionedCall/sequential_1/conv2d_transpose_2/strided_slice_1/stack_2"], "attr": {"end_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "ellipsis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "shrink_axis_mask": {"i": "1"}, "Index": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/sequential_1/conv2d_transpose_2/strided_slice_2", "op": "StridedSlice", "input": ["StatefulPartitionedCall/StatefulPartitionedCall/sequential_1/conv2d_transpose_2/Shape", "StatefulPartitionedCall/StatefulPartitionedCall/sequential_1/conv2d_transpose_2/strided_slice_2/stack", "StatefulPartitionedCall/StatefulPartitionedCall/sequential_1/conv2d_transpose_2/strided_slice_2/stack_1", "StatefulPartitionedCall/StatefulPartitionedCall/sequential_1/conv2d_transpose_2/strided_slice_2/stack_2"], "attr": {"begin_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "1"}, "T": {"type": "DT_INT32"}, "ellipsis_mask": {"i": "0"}, "end_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/sequential_1/conv2d_transpose_2/mul", "op": "Mul", "input": ["StatefulPartitionedCall/StatefulPartitionedCall/sequential_1/conv2d_transpose_2/strided_slice_1", "StatefulPartitionedCall/StatefulPartitionedCall/sequential_1/conv2d_transpose_2/mul/y"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/sequential_1/conv2d_transpose_2/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/StatefulPartitionedCall/sequential_1/conv2d_transpose_2/strided_slice_2", "StatefulPartitionedCall/StatefulPartitionedCall/sequential_1/conv2d_transpose_2/mul_1/y"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/sequential_1/conv2d_transpose_2/add", "op": "AddV2", "input": ["StatefulPartitionedCall/StatefulPartitionedCall/sequential_1/conv2d_transpose_2/mul", "StatefulPartitionedCall/StatefulPartitionedCall/sequential_1/conv2d_transpose_2/add/y"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/sequential_1/conv2d_transpose_2/add_1", "op": "AddV2", "input": ["StatefulPartitionedCall/StatefulPartitionedCall/sequential_1/conv2d_transpose_2/mul_1", "StatefulPartitionedCall/StatefulPartitionedCall/sequential_1/conv2d_transpose_2/add_1/y"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/sequential_1/conv2d_transpose_2/stack", "op": "Pack", "input": ["StatefulPartitionedCall/StatefulPartitionedCall/sequential_1/conv2d_transpose_2/strided_slice", "StatefulPartitionedCall/StatefulPartitionedCall/sequential_1/conv2d_transpose_2/add", "StatefulPartitionedCall/StatefulPartitionedCall/sequential_1/conv2d_transpose_2/add_1", "StatefulPartitionedCall/StatefulPartitionedCall/sequential_1/conv2d_transpose_2/stack/3"], "attr": {"axis": {"i": "0"}, "T": {"type": "DT_INT32"}, "N": {"i": "4"}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/sequential_1/conv2d_transpose_2/conv2d_transpose", "op": "Conv2DBackpropInput", "input": ["StatefulPartitionedCall/StatefulPartitionedCall/sequential_1/conv2d_transpose_2/stack", "Func/StatefulPartitionedCall/StatefulPartitionedCall/input/_26", "StatefulPartitionedCall/StatefulPartitionedCall/sequential_1/conv2d_transpose_1/Relu"], "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "explicit_paddings": {"list": {}}, "padding": {"s": "VkFMSUQ="}, "use_cudnn_on_gpu": {"b": true}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/sequential_1/conv2d_transpose_2/BiasAdd", "op": "BiasAdd", "input": ["StatefulPartitionedCall/StatefulPartitionedCall/sequential_1/conv2d_transpose_2/conv2d_transpose", "Func/StatefulPartitionedCall/StatefulPartitionedCall/input/_27"], "attr": {"data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/sequential_1/conv2d_transpose_2/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/StatefulPartitionedCall/sequential_1/conv2d_transpose_2/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/sequential_1/conv2d_transpose_3/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/StatefulPartitionedCall/sequential_1/conv2d_transpose_2/Relu"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/sequential_1/conv2d_transpose_3/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/StatefulPartitionedCall/sequential_1/conv2d_transpose_3/Shape", "StatefulPartitionedCall/StatefulPartitionedCall/sequential_1/conv2d_transpose_3/strided_slice/stack", "StatefulPartitionedCall/StatefulPartitionedCall/sequential_1/conv2d_transpose_3/strided_slice/stack_1", "StatefulPartitionedCall/StatefulPartitionedCall/sequential_1/conv2d_transpose_3/strided_slice/stack_2"], "attr": {"Index": {"type": "DT_INT32"}, "end_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "1"}, "begin_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/sequential_1/conv2d_transpose_3/strided_slice_1", "op": "StridedSlice", "input": ["StatefulPartitionedCall/StatefulPartitionedCall/sequential_1/conv2d_transpose_3/Shape", "StatefulPartitionedCall/StatefulPartitionedCall/sequential_1/conv2d_transpose_3/strided_slice_1/stack", "StatefulPartitionedCall/StatefulPartitionedCall/sequential_1/conv2d_transpose_3/strided_slice_1/stack_1", "StatefulPartitionedCall/StatefulPartitionedCall/sequential_1/conv2d_transpose_3/strided_slice_1/stack_2"], "attr": {"T": {"type": "DT_INT32"}, "ellipsis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "begin_mask": {"i": "0"}, "shrink_axis_mask": {"i": "1"}, "end_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/sequential_1/conv2d_transpose_3/strided_slice_2", "op": "StridedSlice", "input": ["StatefulPartitionedCall/StatefulPartitionedCall/sequential_1/conv2d_transpose_3/Shape", "StatefulPartitionedCall/StatefulPartitionedCall/sequential_1/conv2d_transpose_3/strided_slice_2/stack", "StatefulPartitionedCall/StatefulPartitionedCall/sequential_1/conv2d_transpose_3/strided_slice_2/stack_1", "StatefulPartitionedCall/StatefulPartitionedCall/sequential_1/conv2d_transpose_3/strided_slice_2/stack_2"], "attr": {"new_axis_mask": {"i": "0"}, "shrink_axis_mask": {"i": "1"}, "end_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "begin_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/sequential_1/conv2d_transpose_3/mul", "op": "Mul", "input": ["StatefulPartitionedCall/StatefulPartitionedCall/sequential_1/conv2d_transpose_3/strided_slice_1", "StatefulPartitionedCall/StatefulPartitionedCall/sequential_1/conv2d_transpose_3/mul/y"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/sequential_1/conv2d_transpose_3/mul_1", "op": "Mul", "input": 