{"format": "graph-model", "generatedBy": "2.3.1", "convertedBy": "TensorFlow.js Converter v2.7.0", "userDefinedMetadata": {"signature": {"inputs": {"x:0": {"name": "x:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "64"}, {"size": "64"}, {"size": "3"}]}}}, "outputs": {"Identity:0": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "10"}]}}, "Identity_1:0": {"name": "Identity_1:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "10"}]}}}}}, "modelTopology": {"node": [{"name": "x", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "64"}, {"size": "64"}, {"size": "3"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/StatefulPartitionedCall/input/_26", "op": "Const", "input": ["^x"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}, {"size": "10"}]}}}}}, {"name": "Func/StatefulPartitionedCall/StatefulPartitionedCall/input/_27", "op": "Const", "input": ["^x"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "10"}]}}}}}, {"name": "Func/StatefulPartitionedCall/StatefulPartitionedCall/input/_18", "op": "Const", "input": ["^x"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}, {"size": "4"}, {"size": "3"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/flatten_1/Const", "op": "Const", "input": ["^x"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "Func/StatefulPartitionedCall/StatefulPartitionedCall/input/_19", "op": "Const", "input": ["^x"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}}}, {"name": "Func/StatefulPartitionedCall/StatefulPartitionedCall/input/_20", "op": "Const", "input": ["^x"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}, {"size": "4"}, {"size": "32"}, {"size": "32"}]}}}}}, {"name": "Func/StatefulPartitionedCall/StatefulPartitionedCall/input/_21", "op": "Const", "input": ["^x"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}}}, {"name": "Func/StatefulPartitionedCall/StatefulPartitionedCall/input/_22", "op": "Const", "input": ["^x"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}, {"size": "4"}, {"size": "32"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/StatefulPartitionedCall/input/_23", "op": "Const", "input": ["^x"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/StatefulPartitionedCall/input/_28", "op": "Const", "input": ["^x"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}, {"size": "10"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/StatefulPartitionedCall/input/_24", "op": "Const", "input": ["^x"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}, {"size": "4"}, {"size": "64"}, {"size": "64"}]}}}}}, {"name": "Func/StatefulPartitionedCall/StatefulPartitionedCall/input/_25", "op": "Const", "input": ["^x"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}}}, {"name": "Func/StatefulPartitionedCall/StatefulPartitionedCall/input/_29", "op": "Const", "input": ["^x"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "10"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/sequential/conv2d/Relu", "op": "_FusedConv2D", "input": ["x", "Func/StatefulPartitionedCall/StatefulPartitionedCall/input/_18", "Func/StatefulPartitionedCall/StatefulPartitionedCall/input/_19"], "device": "/device:CPU:0", "attr": {"strides": {"list": {"i": ["1", "2", "2", "1"]}}, "padding": {"s": "VkFMSUQ="}, "explicit_paddings": {"list": {}}, "data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "use_cudnn_on_gpu": {"b": true}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/sequential/conv2d_1/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/StatefulPartitionedCall/sequential/conv2d/Relu", "Func/StatefulPartitionedCall/StatefulPartitionedCall/input/_20", "Func/StatefulPartitionedCall/StatefulPartitionedCall/input/_21"], "device": "/device:CPU:0", "attr": {"num_args": {"i": "1"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "T": {"type": "DT_FLOAT"}, "use_cudnn_on_gpu": {"b": true}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "epsilon": {"f": 0.0}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "padding": {"s": "VkFMSUQ="}, "explicit_paddings": {"list": {}}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/sequential/conv2d_2/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/StatefulPartitionedCall/sequential/conv2d_1/Relu", "Func/StatefulPartitionedCall/StatefulPartitionedCall/input/_22", "Func/StatefulPartitionedCall/StatefulPartitionedCall/input/_23"], "device": "/device:CPU:0", "attr": {"data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "epsilon": {"f": 0.0}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "padding": {"s": "VkFMSUQ="}, "T": {"type": "DT_FLOAT"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "num_args": {"i": "1"}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/sequential/conv2d_3/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/StatefulPartitionedCall/sequential/conv2d_2/Relu", "Func/StatefulPartitionedCall/StatefulPartitionedCall/input/_24", "Func/StatefulPartitionedCall/StatefulPartitionedCall/input/_25"], "device": "/device:CPU:0", "attr": {"padding": {"s": "VkFMSUQ="}, "T": {"type": "DT_FLOAT"}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "epsilon": {"f": 0.0}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "num_args": {"i": "1"}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/flatten_1/Reshape", "op": "Reshape", "input": ["StatefulPartitionedCall/StatefulPartitionedCall/sequential/conv2d_3/Relu", "StatefulPartitionedCall/StatefulPartitionedCall/flatten_1/Const"], "attr": {"Tshape": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/dense/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/StatefulPartitionedCall/flatten_1/Reshape", "Func/StatefulPartitionedCall/StatefulPartitionedCall/input/_26", "Func/StatefulPartitionedCall/StatefulPartitionedCall/input/_27"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}, "epsilon": {"f": 0.0}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "transpose_a": {"b": false}, "transpose_b": {"b": false}, "num_args": {"i": "1"}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/dense_1/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/StatefulPartitionedCall/flatten_1/Reshape", "Func/StatefulPartitionedCall/StatefulPartitionedCall/input/_28", "Func/StatefulPartitionedCall/StatefulPartitionedCall/input/_29"], "device": "/device:CPU:0", "attr": {"num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "transpose_a": {"b": false}, "T": {"type": "DT_FLOAT"}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}}}, {"name": "Identity", "op": "Identity", "input": ["StatefulPartitionedCall/StatefulPartitionedCall/dense/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Identity_1", "op": "Identity", "input": ["StatefulPartitionedCall/StatefulPartitionedCall/dense_1/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {"producer": 440}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "Func/StatefulPartitionedCall/StatefulPartitionedCall/input/_26", "shape": [256, 10], "dtype": "float32"}, {"name": "Func/StatefulPartitionedCall/StatefulPartitionedCall/input/_27", "shape": [10], "dtype": "float32"}, {"name": "Func/StatefulPartitionedCall/StatefulPartitionedCall/input/_18", "shape": [4, 4, 3, 32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/flatten_1/Const", "shape": [2], "dtype": "int32"}, {"name": "Func/StatefulPartitionedCall/StatefulPartitionedCall/input/_19", "shape": [32], "dtype": "float32"}, {"name": "Func/StatefulPartitionedCall/StatefulPartitionedCall/input/_20", "shape": [4, 4, 32, 32], "dtype": "float32"}, {"name": "Func/StatefulPartitionedCall/StatefulPartitionedCall/input/_21", "shape": [32], "dtype": "float32"}, {"name": "Func/StatefulPartitionedCall/StatefulPartitionedCall/input/_22", "shape": [4, 4, 32, 64], "dtype": "float32"}, {"name": "Func/StatefulPartitionedCall/StatefulPartitionedCall/input/_23", "shape": [64], "dtype": "float32"}, {"name": "Func/StatefulPartitionedCall/StatefulPartitionedCall/input/_28", "shape": [256, 10], "dtype": "float32"}, {"name": "Func/StatefulPartitionedCall/StatefulPartitionedCall/input/_24", "shape": [4, 4, 64, 64], "dtype": "float32"}, {"name": "Func/StatefulPartitionedCall/StatefulPartitionedCall/input/_25", "shape": [64], "dtype": "float32"}, {"name": "Func/StatefulPartitionedCall/StatefulPartitionedCall/input/_29", "shape": [10], "dtype": "float32"}]}]}